app/views/recipes/show.html.erb

			<button type="button" class="btn btn-large btn-success disabled pull-right" disabled="disabled"><%= @recipe[:recipe_content].meal_class %></button>
			<% (0...(@recipe[:recipe_content].aggregate_ratings.to_i)).each do %>
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."recipe_id" IN (34)