app/controllers/recipes_controller.rb

  def index
    @user = User.find_by_id(session[:user_id])
    @recipes = Recipe.all
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "recipes".* FROM "recipes"

  def show
    @recipe = Recipe.find(params[:id]).get_recipe_details
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", "5"]]

  def edit
    @recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", "3"]]

  def create
    puts params.inspect
    @recipe = Recipe.new(params[:recipe])
    ingredients_list = params[:ingredient]
    photo_list = params[:avatar]
    respond_to do |format|
      if @recipe.create_recipe(ingredients_list: ingredients_list, photo_list: photo_list)
---
INSERT INTO "ingredients" ("approved", "calories_per_quantity", "created_at", "creator_id", "meal_class", "name", "std_measurement", "std_quantity", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "photos" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "recipe_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "recipe_ingredients" ("ingredient_id", "quantity", "recipe_id") VALUES ($1, $2, $3)  [["ingredient_id", 61], ["quantity", 12], ["recipe_id", 33]]
INSERT INTO "recipes" ("aggregate_ratings", "approved", "created_at", "creator_id", "description", "image_links", "meal_class", "name", "rejected", "serves", "total_calories", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"