app/controllers/sessions_controller.rb

  def create
    user = User.find_by_email(params[:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'ankita@ankita' LIMIT 1