app/controllers/users_controller.rb

  def create

    # @user = User.new(:name => params[:name], :email=> params[:email], :password => params[:password], :password_confirmation => params[:password_confirmation])

    puts "===============sign up=============="


    @user = User.new(params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "is_admin", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"